{
    "About": "معلومات عنا",
    "Expertise": "الخبرات",
    "Contact": "اتصل",
    "Products": "المنتجات",
    "Download Catalog": "تحميل الكتالوج",
    "Karar Trading Co LLC":"شركة كرار التجارية ذ.م.م",
    "Welcome to Karar Trading Co. LLC – a name synonymous with 35 years of excellence in the steel industry. As the UAE’s leading importer and stockist, we are proud to be a trusted partner for industries across the Middle East and beyond. Our extensive inventory is sourced from globally renowned manufacturers in Europe, Japan, the USA, South Korea, and China, ensuring superior quality and performance.":"مرحبًا بكم في شركة كرار التجارية ذ.م.م. - اسم مرادف لـ 35 عامًا من التميز في صناعة الصلب. باعتبارنا المستورد والمخزن الرائد في دولة الإمارات العربية المتحدة، نحن فخورون بكوننا شريكًا موثوقًا به للصناعات في جميع أنحاء الشرق الأوسط وخارجه. يتم الحصول على مخزوننا الواسع من الشركات المصنعة المشهورة عالميًا في أوروبا واليابان والولايات المتحدة الأمريكية وكوريا الجنوبية والصين، مما يضمن الجودة والأداء الفائقين.",
    "For over three decades, we have been at the forefront of serving critical sectors such as oil and gas, fertilizers, textiles, marine, offshore, and manufacturing. Our comprehensive product range includes premium stainless steel, carbon steel, and alloy steel pipes, fittings, flanges, valves, gaskets, and fasteners, designed to meet the most stringent industrial demands. Our reputation is built on reliability and responsiveness. We not only fulfill urgent material needs within the Middle East but also extend our services to South East Asia and other regions with seamless export solutions from our ready-to-ship stock.":"لأكثر من ثلاثة عقود، كنا في الطليعة في خدمة القطاعات الحيوية مثل النفط والغاز والأسمدة والمنسوجات والبحرية والبحرية والتصنيع. تشمل مجموعة منتجاتنا الشاملة الأنابيب والتجهيزات والفلنجات والصمامات والحشيات والمثبتات المصنوعة من الفولاذ المقاوم للصدأ والفولاذ الكربوني وسبائك الفولاذ الممتازة، والمصممة لتلبية المتطلبات الصناعية الأكثر صرامة. سمعتنا مبنية على الموثوقية والاستجابة. نحن لا نلبي الاحتياجات المادية العاجلة في الشرق الأوسط فحسب، بل نقوم أيضًا بتوسيع خدماتنا إلى جنوب شرق آسيا ومناطق أخرى من خلال حلول تصدير سلسة من مخزوننا الجاهز للشحن.",
    "Qualities & Expertise of Karar Trading Co LLC.":"صفات وخبرات شركة كرار التجارية ذ.م.م.",
    "About Us":"معلومات عنا",
    "View Products":"عرض المنتجات بنا",
    "With 35 years of excellence, Karar Trading Co. LLC has established itself as a trusted supplier of premium-quality materials. We specialize in the supply of stainless steel, carbon steel, alloy steel, and nickel alloy steel products, catering to diverse industries with a commitment to quality and reliability.":"مع 35 عامًا من التميز، رسخت شركة كرار التجارية ذ.م.م مكانتها كمورد موثوق للمواد عالية الجودة. نحن متخصصون في توريد منتجات الفولاذ المقاوم للصدأ والفولاذ الكربوني وسبائك الصلب وسبائك النيكل، لتلبية احتياجات الصناعات المتنوعة مع الالتزام بالجودة والموثوقية.",
    "Sector we work in.": "القطاعات التي نعمل بها.",
    "Karar Trading Co LLC serves a wide array of industries with high-quality steel products, including:": "تقدم شركة قرار للتجارة ذ.م.م مجموعة واسعة من الصناعات بمنتجات فولاذية عالية الجودة، بما في ذلك:",
    "Textile: Durable materials for machinery and infrastructure.": "النسيج: مواد متينة للآلات والبنية التحتية.",
    "Food: Hygienic and corrosion-resistant steel solutions.": "الأغذية: حلول فولاذية صحية ومقاومة للتآكل.",
    "Oil & Gas Refineries: Reliable components for high-pressure and critical operations.": "تكرير النفط والغاز: مكونات موثوقة للعمليات ذات الضغط العالي والحساسة.",
    "Steel Manufacturing: Premium-grade steel for fabrication and production.": "تصنيع الفولاذ: فولاذ عالي الجودة للتصنيع والإنتاج.",
    "Engineering": "الهندسة",
    "Industrial":"صناعي",
    "We specialize in supplying engineering projects with:": "نحن متخصصون في تزويد المشاريع الهندسية بـ:",
    "Structural steel for construction and design.": "فولاذ إنشائي للبناء والتصميم.",
    "Precision-crafted components for industrial applications.": "مكونات مصنعة بدقة للتطبيقات الصناعية.",
    "Customized steel solutions tailored to unique engineering challenges.": "حلول فولاذية مخصصة مصممة لتلبية تحديات هندسية فريدة.",
    "Corporate Office":"مكتب الشركة"

}
  